import { Platrform_Privileges__itemProps } from "../ui/Platform_Privileges__item/model/Platform_Privileges__item__types";

export const Platform_Privileges__items: Platrform_Privileges__itemProps[] = [
  {
    index: "01",
    caption: "На площадку попадают проверенные и качественные каналы.",
    text: "Мы проводим жесткую модерацию",
  },
  {
    index: "02",
    caption: "Не работаем с мошенниками и непроверенными исполнителями.",
    text: "Все исполнители проходят проверку на нарушения в telegram-рынке.",
  },
  {
    index: "03",
    caption:
      "Денежные средства приходят исполнителю только после выполнения своих задач. ",
    text: "После покупки услуг сумма оплаченная вами замораживается на нашей площадке и только после завершения заказа исполнителю приходит оплата",
  },
  {
    index: "04",
    caption: "Контролируем весь процесс работы",
    text: "Выход рекламы, сроки исполнения, поддержка 24/7",
  },
  {
    index: "05",
    caption: "Работаем по договору.",
    text: "Заключаем договоры между исполнителем и заказчиком. Полный электронный документооборот",
  },
  {
    index: "06",
    caption: "Экономия времени.",
    text: "На нашей площадке собраны чистые проверенные каналы и исполнители огромного выбора услуг",
  },
  {
    index: "07",
    caption: "Автоматическая маркировка рекламы  в ОРД",
    text: "Наша площадка самостоятельно выполнит всю работу связанную с маркировкой рекламного поста и документами.",
  },
  {
    index: "08",
    caption:
      "Приемлемые цены -  ценовая политика строится согласно рыночным ценам.",
  },
];
