import { URL_PART } from "@/shared/const/app";
import { FAQTabItem } from "@/shared/ui-kit/FAQ_accordion";
import { KindDeedsAlreadyHelpedItemProps } from "@/widgets/KindDeedsPage_widgets/KindDeedsAlreadyHelpedItem";
import { KindDeedsNeedHelpItemProps } from "@/widgets/KindDeedsPage_widgets/KindDeedsNeedHelpItem";

export const KindDeedsAlreadyHelpedItems: KindDeedsAlreadyHelpedItemProps[] = [
  {
    id: 0,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 1,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 2,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 3,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 4,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 5,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 6,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 7,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 8,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },

  {
    id: 9,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 1549000,
  },
];

export const KindDeedsNeedHelpItems: KindDeedsNeedHelpItemProps[] = [
  {
    id: 0,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 549000,
    alreadyGathered: 500000,
    urgentHelp: true,
  },

  {
    id: 1,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 549000,
    alreadyGathered: 20000,
  },

  {
    id: 2,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 59000,
    alreadyGathered: 20000,
  },

  {
    id: 3,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 590000,
    alreadyGathered: 250000,
    urgentHelp: true,
  },

  {
    id: 4,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 5900000,
    alreadyGathered: 5900000,
  },

  {
    id: 5,
    imgURL: `${URL_PART}/KindDeeds/personExample_img.jpg`,
    person: "Иван Иванов",
    city: "Москва",
    age: "1 год",
    desc: "Диагноз или краткое описание ситуации, например: необходим запас специализированного питания на 6 месяцев.",
    price: 590000,
    alreadyGathered: 0,
  },
];

export const KindDeedsFAQItems: FAQTabItem[] = [
  {
    title: "Куда идут средства от пожертвований?",
    desc: "Все собранные средства направляются на поддержание благотворительных проектов, помощь нуждающимся и реализацию социальных инициатив. Мы публикуем отчеты о расходах на нашем сайте для вашей прозрачности.",
  },

  {
    title: "Как часто я могу ожидать обновления о ваших проектах?",
    desc: "Все собранные средства направляются на поддержание благотворительных проектов, помощь нуждающимся и реализацию социальных инициатив. Мы публикуем отчеты о расходах на нашем сайте для вашей прозрачности.",
  },

  {
    title: "Можно ли пожертвовать вещи или продукты?",
    desc: "Все собранные средства направляются на поддержание благотворительных проектов, помощь нуждающимся и реализацию социальных инициатив. Мы публикуем отчеты о расходах на нашем сайте для вашей прозрачности.",
  },

  {
    title:
      "Как я могу быть уверен в том, что мои деньги идут на благотворительность?",
    desc: "Все собранные средства направляются на поддержание благотворительных проектов, помощь нуждающимся и реализацию социальных инициатив. Мы публикуем отчеты о расходах на нашем сайте для вашей прозрачности.",
  },

  {
    title: "Могу ли я сделать регулярное пожертвование?",
    desc: "Все собранные средства направляются на поддержание благотворительных проектов, помощь нуждающимся и реализацию социальных инициатив. Мы публикуем отчеты о расходах на нашем сайте для вашей прозрачности.",
  },

  {
    title: "Как я могу помочь?",
    desc: "Все собранные средства направляются на поддержание благотворительных проектов, помощь нуждающимся и реализацию социальных инициатив. Мы публикуем отчеты о расходах на нашем сайте для вашей прозрачности.",
  },
];
