import { HowItWorksItem } from "../ui/HowItWorks__item/model/HowItWorks__types";

export const HowItWorksItems: HowItWorksItem[] = [
  {
    index: "01",
    text: "Регистрируйте аккаунт",
    button: "Создать аккаунт",
  },
  {
    index: "02",
    text: "Выберите подходящую категорию услуг:",
    list: [
      "Покупка рекламы, покупка telegram-канала",
      "Услуги закупа, дизайнера, копирайтера, видео-монтажера, программиста",
    ],
  },
  {
    index: "03",
    text: "Выберите исполнителя",
  },
  {
    index: "04",
    text: "Пополните баланс удобным способом:",
    list: ["Visa/MasterCard/МИР, Qiwi", "Банковский перевод"],
  },
  {
    index: "05",
    text: "Отправьте ваш рекламный пост либо техническое задание исполнителю и ожидайте ответа",
  },
  {
    index: "06",
    text: "Получайте результат с вашей заявки",
  },
];
