import { FAQTabsInterface } from "@/widgets/Global_widgets/FAQ_accordion/ui/FAQTab_Accordion_item/model/FAQTab_Accordion_item_types";
import { FAQTabs } from "../../FAQHeader";

export const faqTabs: FAQTabsInterface = {
  [FAQTabs.GENERAL]: [
    {
      title: "Что за интеграции в Telegram?",
      desc: `Какой толк от этого размещения?
Вы получите внимание вашей целевой аудитории. Средний возраст пользователей Telegram
составляет 23-35 лет.
Это огромный пласт платежеспособной аудитории, который мы объединили в сервисе TeleWorks`,
    },

    {
      title: "Сколько стоят услуги менеджера?",
      desc: `Какой толк от этого размещения?
Вы получите внимание вашей целевой аудитории. Средний возраст пользователей Telegram
составляет 23-35 лет.
Это огромный пласт платежеспособной аудитории, который мы объединили в сервисе TeleWorks`,
    },

    {
      title: "Что входит в прогноз результатов кампании?",
      desc: `Какой толк от этого размещения?
Вы получите внимание вашей целевой аудитории. Средний возраст пользователей Telegram
составляет 23-35 лет.
Это огромный пласт платежеспособной аудитории, который мы объединили в сервисе TeleWorks`,
    },

    {
      title: "Менеджер поможет мне написать рекламный текст?",
      desc: `Какой толк от этого размещения?
Вы получите внимание вашей целевой аудитории. Средний возраст пользователей Telegram
составляет 23-35 лет.
Это огромный пласт платежеспособной аудитории, который мы объединили в сервисе TeleWorks`,
    },

    {
      title: "Как работает автоматическая маркировка рекламы?",
      desc: `Какой толк от этого размещения?
Вы получите внимание вашей целевой аудитории. Средний возраст пользователей Telegram
составляет 23-35 лет.
Это огромный пласт платежеспособной аудитории, который мы объединили в сервисе TeleWorks`,
    },

    {
      title: "Какие данные я получу по результатам кампании?",
      desc: `Какой толк от этого размещения?
Вы получите внимание вашей целевой аудитории. Средний возраст пользователей Telegram
составляет 23-35 лет.
Это огромный пласт платежеспособной аудитории, который мы объединили в сервисе TeleWorks`,
    },
  ],
  [FAQTabs.FOR_CUSTOMER]: [
    {
      title: "Как мне разместить интеграцию?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Вы можете мне помочь подобрать каналы?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Сколько стоит?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Как расчитать справедливую стоимость интеграции в канале?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Как пополнить баланс? Что принимаете?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Что обозначают форматы размещения 1/24, 2/48, 3/72.",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },
  ],
  [FAQTabs.FOR_CHANNEL_OWNER]: [
    {
      title: "Как мне разместить интеграцию? Владельцу канала",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Вы можете мне помочь подобрать каналы?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Сколько стоит?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Как расчитать справедливую стоимость интеграции в канале?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Как пополнить баланс? Что принимаете?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Что обозначают форматы размещения 1/24, 2/48, 3/72.",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },
  ],
  [FAQTabs.FREELANCE]: [
    {
      title: "Как мне разместить интеграцию? Фриланс",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Вы можете мне помочь подобрать каналы?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Сколько стоит?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Как расчитать справедливую стоимость интеграции в канале?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Как пополнить баланс? Что принимаете?",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },

    {
      title: "Что обозначают форматы размещения 1/24, 2/48, 3/72.",
      desc: `Для создания проекта необходимо выбрать канал или чат (группу) из каталога, далее заполнить карточку проекта.`,
    },
  ],
};
